package com.ellize.ltc;

import android.graphics.Color;

class Constants {
    /**
     * ИД канал уведомлений
     */
    public static final String CHANNEL_ID = "crush service";
    /**
     * минимальный предел по падению
     */
    public static final float MIN_BARRIER = 1.5f;
    public static final long LOCATION_MINTIME = 30 * 1000;
    public static final float LOCATION_MINDSTANCE = 1;
    public static final String DEMO_IDEAS ="{\n" +
            "  \"items\": [\n" +
            "    {\n" +
            "      \"id\": 1,\n" +
            "      \"text\": \"Пожалуйста, замените уже эту 1C! Невозможно работать, ну правда\",\n" +
            "      \"raiting\": 0,\n" +
            "      \"tags\": [\n" +
            "        \"Офис\",\n" +
            "        \"Работа\"\n" +
            "      ],\n" +
            "      \"files\": [],\n" +
            "      \"createdDate\": \"2020-11-28T23:43:16.074941\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 2,\n" +
            "      \"text\": \"Есть проблема: наш офис работает на очень древних компах. Вообще нельзя код писать, напишите, кто готов создать предложение или помочь оформить!\",\n" +
            "      \"raiting\": 10,\n" +
            "      \"tags\": [\n" +
            "        \"Офис\",\n" +
            "        \"Работа\"\n" +
            "      ],\n" +
            "      \"files\": [],\n" +
            "      \"createdDate\": \"2020-11-25T23:43:16.074941\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 3,\n" +
            "      \"text\": \"У всех так? Чтобы взять больничный нужно обзвонить 10 номеров!! ДЕСЯТЬ!!! Отпишите у кого так, если что, то подготовлю предложение\",\n" +
            "      \"raiting\": 40,\n" +
            "      \"tags\": [\n" +
            "        \"работа\",\n" +
            "        \"досуг\"\n" +
            "      ],\n" +
            "      \"files\": [],\n" +
            "      \"createdDate\": \"2020-11-26T23:43:16.074941\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 4,\n" +
            "      \"text\": \"Смотрите. У нас все пацаны вокруг пишут код на С, а мы до сих пор на Ассемблере сидим, прикиньте?! Давайте соберемся и предложим уже поменять подход\",\n" +
            "      \"raiting\": 6,\n" +
            "      \"tags\": [\n" +
            "        \"ит_отдел\",\n" +
            "        \"работа\"\n" +
            "      ],\n" +
            "      \"files\": [],\n" +
            "      \"createdDate\": \"2020-11-21T23:13:16.074941\"\n" +
            "    },\n" +
            "    {\n" +
            "      \"id\": 5,\n" +
            "      \"text\": \"Не нравится структура должностей у нас в продажах. Помогите подготовить предложение, будьте лапочками :з\",\n" +
            "      \"raiting\": 60,\n" +
            "      \"tags\": [\n" +
            "        \"офис\",\n" +
            "        \"отдел_продаж\"\n" +
            "      ],\n" +
            "      \"files\": [],\n" +
            "      \"createdDate\": \"2020-10-25T23:33:16.074941\"\n" +
            "    }\n" +
            "\n" +
            "  ],\n" +
            "  \"count\": 5\n" +
            "}";


}
